IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0c110x/TIMG14_1.0.xml
    </group>
    <register id="TIMG14_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="EVT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][1]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT2_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][1]" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="TIMG14_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="TIMG14_COMMONREGS" name="TIMG14_COMMONREGS" instances="1" offset="0x1100" instaddr="0x2F" description="">
        <register id="TIMG14_CCPD" width="32" offset="0x0" description="CCP Direction">
            <bitfield id="C0CCP0" description="Counter CCP0" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
            <bitfield id="C0CCP1" description="Counter CCP1" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
        </register>
        <register id="TIMG14_ODIS" width="32" offset="0x4" description="Output Disable">
            <bitfield id="C0CCP0" description="Counter CCP0 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to occpout[0]."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[0] is forced low."/>
            </bitfield>
            <bitfield id="C0CCP1" description="Counter CCP1 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to occpout[1]."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[1] is forced low."/>
            </bitfield>
        </register>
        <register id="TIMG14_CCLKCTL" width="32" offset="0x8" description="Counter Clock Control Register">
            <bitfield id="CLKEN" description="Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Clock is disabled."/>
                <bitenum id="ENABLED" value="0x1" description="Clock is enabled"/>
            </bitfield>
        </register>
