IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0c110x/TIMG14_1.0.xml
        <register id="TIMG14_IFCTL_23" width="32" offset="0x88" instances="2" instaddr="0x4" description="Input Filter Control Register">
            <bitfield id="ISEL" description="Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="CCPX_INPUT" value="0x0" description="CCP of the corresponding capture compare unit"/>
                <bitenum id="CCPX_INPUT_PAIR" value="0x1" description="Input pair CCPX of the capture compare unit. For CCP0 input pair is CCP1 and for CCP1 input pair is CCP0."/>
                <bitenum id="CCP0_INPUT" value="0x2" description="CCP0 of the counter"/>
                <bitenum id="TRIG_INPUT" value="0x3" description="Trigger"/>
                <bitenum id="CCP_XOR" value="0x4" description="XOR of CCP inputs as input source."/>
                <bitenum id="FSUB0" value="0x5" description="subscriber 0 event as input source."/>
                <bitenum id="FSUB1" value="0x6" description="subscriber 1 event as input source."/>
                <bitenum id="COMP0" value="0x7" description="Comparator 0 output."/>
                <bitenum id="COMP1" value="0x8" description="Comparator 1 output."/>
                <bitenum id="COMP2" value="0x9" description="Comparator 2 output."/>
            </bitfield>
            <bitfield id="INV" description="Input Inversion This bit controls whether the selected input is inverted." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOINVERT" value="0x0" description="Noninverted"/>
                <bitenum id="INVERT" value="0x1" description="Inverted"/>
            </bitfield>
            <bitfield id="FP" description="Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering." begin="9" end="8" width="2" rwaccess="R/W">
                <bitenum id="_3" value="0x0" description="The division factor is 3"/>
                <bitenum id="_5" value="0x1" description="The division factor is 5"/>
                <bitenum id="_8" value="0x2" description="The division factor is 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="Consecutive" value="0x0" description="Consecutive Periods The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="Voting" value="0x1" description="Voting  The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output."/>
            </bitfield>
            <bitfield id="FE" description="Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Bypass."/>
                <bitenum id="ENABLED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        <register id="TIMG14_TSEL" width="32" offset="0xB0" description="Trigger Select">
            <bitfield id="ETSEL" description="External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules in the same power domain. Refer to the SoC datasheet to get details.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use." begin="4" end="0" width="5" rwaccess="R/W">
                <bitenum id="TRIG0" value="0x0" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG1" value="0x1" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG2" value="0x2" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG3" value="0x3" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG4" value="0x4" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG5" value="0x5" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG6" value="0x6" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG7" value="0x7" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG8" value="0x8" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG9" value="0x9" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG10" value="0xA" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG11" value="0xB" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG12" value="0xC" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG13" value="0xD" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG14" value="0xE" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG15" value="0xF" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG_SUB0" value="0x10" description="TRIG_SUBx = External trigger input from subscriber port x."/>
                <bitenum id="TRIG_SUB1" value="0x11" description="TRIG_SUBx = External trigger input from subscriber port x."/>
            </bitfield>
            <bitfield id="TE" description="Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Triggers are not used."/>
                <bitenum id="ENABLED" value="0x1" description="Triggers are used as selected by the IE, ITSEL and ETSEL fields."/>
            </bitfield>
        </register>
    </group>
</module>
